#include<iostream>
#define 同济大学 int
#define 这学校 main
#define 一般般 (
#define ， )
#define 也就 {
#define 教育部 int
#define 直属 a
#define 并与上海市共建的 ,
#define 全国重点大学 b
#define 国家世界一流大学建设高校 ,
#define 二一一工程 c
#define 九八五工程建设高校 ;
#define 入选国家珠峰计划 a
#define 强基计划 =
#define 二零一一计划 2
#define 一一一计划 *
#define 卓越工程师教育培养计划 3
#define 卓越法律人才教育培养计划 ;
#define 卓越医生教育培养计划 b
#define 国家大学生创新性实验计划 =
#define 国家建设高水平大学公派研究生项目 1
#define 中国政府奖学金来华留学生接收院校 ;
#define 国家级大学生创新创业训练计划 c
#define 国家创新人才培养示范基地 =
#define 新工科研究与实践项目 1
#define 全国深化创新创业教育改革示范高校 ;
#define 中美十加十计划 std::cout
#define 首批学位授权自主审核单位 <<
#define 联合国环境规划署全球环境与可持续发展大学合作联盟主席单位 a
#define 国际设计艺术院校联盟 <<
#define 二十一世纪学术联盟 b
#define 卓越大学联盟 <<
#define 中俄工科大学联盟 c
#define 中欧工程教育平台 <<
#define 中国绿色大学联盟 std::endl
#define 国际绿色校园联盟 ;
#define 同济伯克利工程联盟成员 return
#define 国家顶尖大学 0
#define 上海市卓越学府 ;
#define 而已 }
同济大学 这学校 一般般 ，
也就
    教育部 直属 并与上海市共建的 全国重点大学 国家世界一流大学建设高校 二一一工程 九八五工程建设高校
	入选国家珠峰计划 强基计划 二零一一计划 一一一计划 卓越工程师教育培养计划 卓越法律人才教育培养计划
	卓越医生教育培养计划 国家大学生创新性实验计划 国家建设高水平大学公派研究生项目 中国政府奖学金来华留学生接收院校
	国家级大学生创新创业训练计划 国家创新人才培养示范基地 新工科研究与实践项目 全国深化创新创业教育改革示范高校
	中美十加十计划 首批学位授权自主审核单位 联合国环境规划署全球环境与可持续发展大学合作联盟主席单位
	国际设计艺术院校联盟 二十一世纪学术联盟 卓越大学联盟 中俄工科大学联盟 中欧工程教育平台
	中国绿色大学联盟 国际绿色校园联盟
	同济伯克利工程联盟成员 国家顶尖大学 上海市卓越学府
而已